import type { IUserTable } from "../interfaces";

const dataUsers: IUserTable[] = [
	{
		"MAC - адрес": "",
		"Office": "",
		"Windows": "",
		"attachment": "",
		"id": "8",
		"timestamp": "2020-12-01 00:00:00 +0000 UTC",
		"Адрес, кабинет": "",
		"Версия kaspersky": "0",
		"Должность": "Профессор",
		"ЖМД (марка, модель, s/n / инвентарный номер)": "",
		"Иные подключенные устройства": "",
		"Камера (марка, модель, s/n /инвентарный номер)": "",
		"Клавиатура (марка, модель, s/n / инвентарный номер)": "",
		"Колонки (марка, модель, s/n / инвентарный номер)": "",
		"Монитор (марка, модель, s/n / инвентарный номер)": "",
		"Мышь (марка, модель, s/n / инвентарный номер)": "",
		"Наушники (марка, модель, s/n / инвентарный номер)": "",
		"Полное наименование подразделения": "Кафедра Экономической безопасности, финансов и экономического анализа Федерального государственного казенного образовательного учреждения высшего профессионального образования \"Московский университет Министерства внутренних дел Российской Федерации имени В.Я. Кикотя\"",
		"Принтер/МФУ/Скан. (марка, модель, s/n / инвентарный номер)": "",
		"Проектор (марка, модель, s/n / инвентарный номер)": "",
		"Сервисы ИСОД": "",
		"Системный блок (марка, модель, s/n /инвентарный номер)": "",
		"ФИО": "Агапова Татьяна Николаевна",
		"ФИО инженера устанвливающего ПО": "0",
		"кабинет": "200",
		"установлен ДСТ (1-да/0-нет)": "",
		"№ кабинета": ""
	},
	{
		"MAC - адрес": "",
		"Office": "",
		"Windows": "",
		"attachment": "",
		"id": "8",
		"timestamp": "2020-12-01 00:00:00 +0000 UTC",
		"Адрес, кабинет": "",
		"Версия kaspersky": "0",
		"Должность": "Профессор",
		"ЖМД (марка, модель, s/n / инвентарный номер)": "",
		"Иные подключенные устройства": "",
		"Камера (марка, модель, s/n /инвентарный номер)": "",
		"Клавиатура (марка, модель, s/n / инвентарный номер)": "",
		"Колонки (марка, модель, s/n / инвентарный номер)": "",
		"Монитор (марка, модель, s/n / инвентарный номер)": "",
		"Мышь (марка, модель, s/n / инвентарный номер)": "",
		"Наушники (марка, модель, s/n / инвентарный номер)": "",
		"Полное наименование подразделения": "Кафедра Экономической безопасности, финансов и экономического анализа Федерального государственного казенного образовательного учреждения высшего профессионального образования \"Московский университет Министерства внутренних дел Российской Федерации имени В.Я. Кикотя\"",
		"Принтер/МФУ/Скан. (марка, модель, s/n / инвентарный номер)": "",
		"Проектор (марка, модель, s/n / инвентарный номер)": "",
		"Сервисы ИСОД": "",
		"Системный блок (марка, модель, s/n /инвентарный номер)": "",
		"ФИО": "Агапова Вероника Петровна",
		"ФИО инженера устанвливающего ПО": "0",
		"кабинет": "200",
		"установлен ДСТ (1-да/0-нет)": "",
		"№ кабинета": ""
	},
	{
		"MAC - адрес": "",
		"Office": "",
		"Windows": "",
		"attachment": "",
		"id": "8",
		"timestamp": "2020-12-01 00:00:00 +0000 UTC",
		"Адрес, кабинет": "",
		"Версия kaspersky": "0",
		"Должность": "Профессор",
		"ЖМД (марка, модель, s/n / инвентарный номер)": "",
		"Иные подключенные устройства": "",
		"Камера (марка, модель, s/n /инвентарный номер)": "",
		"Клавиатура (марка, модель, s/n / инвентарный номер)": "",
		"Колонки (марка, модель, s/n / инвентарный номер)": "",
		"Монитор (марка, модель, s/n / инвентарный номер)": "",
		"Мышь (марка, модель, s/n / инвентарный номер)": "",
		"Наушники (марка, модель, s/n / инвентарный номер)": "",
		"Полное наименование подразделения": "Кафедра Экономической безопасности, финансов и экономического анализа Федерального государственного казенного образовательного учреждения высшего профессионального образования \"Московский университет Министерства внутренних дел Российской Федерации имени В.Я. Кикотя\"",
		"Принтер/МФУ/Скан. (марка, модель, s/n / инвентарный номер)": "",
		"Проектор (марка, модель, s/n / инвентарный номер)": "",
		"Сервисы ИСОД": "",
		"Системный блок (марка, модель, s/n /инвентарный номер)": "",
		"ФИО": "Панасюков Анатолий Крамор",
		"ФИО инженера устанвливающего ПО": "0",
		"кабинет": "200",
		"установлен ДСТ (1-да/0-нет)": "",
		"№ кабинета": ""
	}
];

function getDataUsersBySurname(): Promise<unknown> {
	return new Promise((resolve, reject) => {

	});
};

export { getDataUsersBySurname };
